programming/book/just_enough_software_architecture.org
#+setupfile: ../../styles/readtheorg.setup
#+title: Just Enough Software Architecture

* Preface

There is a difference between being able to hit a tennis ball and knowing why you are able to hit it, what psychologists refer to as procedural knowledge versus declarative knowledge.

-----

What the best developers do is drill down into obstacles in detail, understand them, then pop back up to relate the nature of those obstacles to the architecture as a whole.

* Chapter 1: Introduction

Decade after decade, software systems have seen orders-of-magnitude increases in their size and complexity. Today's software systems are arguably the largest and most complex things ever built.

The increases in software size and complexity have been matched by advances in software engineering. We are no smarter than developers of the previous generation, but our improved weapons allow us to build software of greater size and complexity. Assembly language programming gave way to higher-level languages and structured programming. Procedures have, in many domains, given way to objects. And software reuse, which used to mean just subroutines, is now also done with extensive libraries and frameworks.

-----

Consider a coach and a rookie (a novice sports player) watching the same game. The coach sees more than the rookie, not because the coach's eyes are more acute, but because he has an intangible weapon. He has built up a set of mental abstractions that allow him to convert his perceptions of raw phenomena. Your "point of view is worth 80 IQ points".

** Partitioning, knowledge, and abstractions

Developers partition a problem so that its parts are smaller and more tractable, they apply knowledge of similar problems, and they use abstractions to help them reason.

** Reflections

Despite having the same functionality, systems differ in their modifiability, scalability, and latency. _Quality attributes usually trade off against each other._ The third system was much more scalable than the other two, but its scalability came at the price of reduced ability to make ad hoc queries and a longer wait before results were available.

-----

A "job" is an abstraction that obeys more constraints than an arbitrary "chunk of code" does. _It is hard to reason about an arbitrary chunk of code specifically because you cannot tell what it does not do._ For example, if they constrain jobs to have no side effects, they can run the same job twice, in parallel.

** Perspective shift

Developers, being human, have a hard time envisioning how the static statements of a program will execute at runtime. =GOTO= statements complicate the reasoning about runtime execution, so it is best to avoid =GOTO= statements and embrace structured programming.

-----

If you do not consciously choose the architecture of your systems, then it may end up being a big ball of mud, which they estimate is the most common software architecture. Imagine what a system with 10 classes would look like, then scale it up to 100, 1000, ..., without any new abstractions or partitions, and let the objects in the system communicate with each other as is expedient.

** About this book

Software architecture acts as the skeleton of a system, influences quality attributes, is orthogonal to functionality, and uses constraints to influence a system's properties.

-----

Building encapsulation boundaries is a crucial skill in software architecture. Users of a component or module can often ignore how it works internally, freeing their minds to solve other hard problems. And the builders of an encapsulated component or module have the freedom to change its implementation without perturbing its users.

* Chapter 2: Software Architecture

Architecture choices are most important when:

- the solution space is small
- the risk of failure is high
- there are difficult quality attribute requirements
- you are working in a new domain

** What is software architecture?

#+begin_quote
As the size and complexity of software systems increase, the design and specification of overall system structure become more significant issues than the choice of algorithms and data structures of computation. Structural issues include the organization of a system as a composition of components; global control structures; the protocols for communication, synchronization, and data access; the assignment of functionality to design elements; the composition of design elements; physical distribution; scaling and performance; dimensions of evolution; and selection among design alternatives. This is the software architecture level of design.
#+end_quote

-----

Examples of architectural details that are not limited to the biggest parts in a system: The naming pattern for methods is about as low-level a decision as possible, yet it is architecturally significant for Java Beans. An architecture may prohibit threads, require a method to complete within 100ms, require computation to be divided into jobs, or other details that are down deep in the code.

-----

There is a chain of intentionality from a few high-level intentions or decisions of the architect that reaches down to some low-level details. Most of the details are left open to any reasonable implementation, but some are constrained, via a chain back to the top-level intentions of the designer.

-----

If a detail is important to achieve an overall quality of the system, it is probably architectural.

