programming/book/just_enough_software_architecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Just Enough Software Architecture</title>
<!-- 2018-01-28 Sun 19:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>





</head>
<body>
<div id="content">
<h1 class="title">Just Enough Software Architecture</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Preface</a></li>
<li><a href="#sec-2">2. Chapter 1: Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1. Partitioning, knowledge, and abstractions</a></li>
<li><a href="#sec-2-2">2.2. Reflections</a></li>
<li><a href="#sec-2-3">2.3. Perspective shift</a></li>
<li><a href="#sec-2-4">2.4. About this book</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Chapter 2: Software Architecture</a>
<ul>
<li><a href="#sec-3-1">3.1. What is software architecture?</a></li>
<li><a href="#sec-3-2">3.2. Why is software architecture important?</a></li>
<li><a href="#sec-3-3">3.3. Presumptive architectures</a></li>
<li><a href="#sec-3-4">3.4. How should software architecture be used?</a></li>
<li><a href="#sec-3-5">3.5. Architecture-focused design</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Chapter 3: Risk-Driven Model</a>
<ul>
<li><a href="#sec-4-1">4.1. What is the risk-driven model?</a></li>
<li><a href="#sec-4-2">4.2. Are you risk-driven now?</a></li>
<li><a href="#sec-4-3">4.3. Risks</a></li>
<li><a href="#sec-4-4">4.4. Guidance on choosing techniques</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preface</h2>
<div class="outline-text-2" id="text-1">
<p>
There is a difference between being able to hit a tennis ball and knowing why you are able to hit it, what psychologists refer to as procedural knowledge versus declarative knowledge.
</p>

<hr  />

<p>
What the best developers do is drill down into obstacles in detail, understand them, then pop back up to relate the nature of those obstacles to the architecture as a whole.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Chapter 1: Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
Decade after decade, software systems have seen orders-of-magnitude increases in their size and complexity. Today's software systems are arguably the largest and most complex things ever built.
</p>

<p>
The increases in software size and complexity have been matched by advances in software engineering. We are no smarter than developers of the previous generation, but our improved weapons allow us to build software of greater size and complexity. Assembly language programming gave way to higher-level languages and structured programming. Procedures have, in many domains, given way to objects. And software reuse, which used to mean just subroutines, is now also done with extensive libraries and frameworks.
</p>

<hr  />

<p>
Consider a coach and a rookie (a novice sports player) watching the same game. The coach sees more than the rookie, not because the coach's eyes are more acute, but because he has an intangible weapon. He has built up a set of mental abstractions that allow him to convert his perceptions of raw phenomena. Your "point of view is worth 80 IQ points".
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Partitioning, knowledge, and abstractions</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Developers partition a problem so that its parts are smaller and more tractable, they apply knowledge of similar problems, and they use abstractions to help them reason.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Reflections</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Despite having the same functionality, systems differ in their modifiability, scalability, and latency. <span class="underline">Quality attributes usually trade off against each other.</span> The third system was much more scalable than the other two, but its scalability came at the price of reduced ability to make ad hoc queries and a longer wait before results were available.
</p>

<hr  />

<p>
A "job" is an abstraction that obeys more constraints than an arbitrary "chunk of code" does. <span class="underline">It is hard to reason about an arbitrary chunk of code specifically because you cannot tell what it does not do.</span> For example, if they constrain jobs to have no side effects, they can run the same job twice, in parallel.
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Perspective shift</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Developers, being human, have a hard time envisioning how the static statements of a program will execute at runtime. <code>GOTO</code> statements complicate the reasoning about runtime execution, so it is best to avoid <code>GOTO</code> statements and embrace structured programming.
</p>

<hr  />

<p>
If you do not consciously choose the architecture of your systems, then it may end up being a big ball of mud, which they estimate is the most common software architecture. Imagine what a system with 10 classes would look like, then scale it up to 100, 1000, &#x2026;, without any new abstractions or partitions, and let the objects in the system communicate with each other as is expedient.
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> About this book</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Software architecture acts as the skeleton of a system, influences quality attributes, is orthogonal to functionality, and uses constraints to influence a system's properties.
</p>

<hr  />

<p>
Building encapsulation boundaries is a crucial skill in software architecture. Users of a component or module can often ignore how it works internally, freeing their minds to solve other hard problems. And the builders of an encapsulated component or module have the freedom to change its implementation without perturbing its users.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Chapter 2: Software Architecture</h2>
<div class="outline-text-2" id="text-3">
<p>
Architecture choices are most important when:
</p>

<ul class="org-ul">
<li>the solution space is small
</li>
<li>the risk of failure is high
</li>
<li>there are difficult quality attribute requirements
</li>
<li>you are working in a new domain
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> What is software architecture?</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-quote-container">
<blockquote>
<p>
As the size and complexity of software systems increase, the design and specification of overall system structure become more significant issues than the choice of algorithms and data structures of computation. Structural issues include the organization of a system as a composition of components; global control structures; the protocols for communication, synchronization, and data access; the assignment of functionality to design elements; the composition of design elements; physical distribution; scaling and performance; dimensions of evolution; and selection among design alternatives. This is the software architecture level of design.
</p>
</blockquote>
</div>

<hr  />

<p>
Examples of architectural details that are not limited to the biggest parts in a system: The naming pattern for methods is about as low-level a decision as possible, yet it is architecturally significant for Java Beans. An architecture may prohibit threads, require a method to complete within 100ms, require computation to be divided into jobs, or other details that are down deep in the code.
</p>

<hr  />

<p>
There is a chain of intentionality from a few high-level intentions or decisions of the architect that reaches down to some low-level details. Most of the details are left open to any reasonable implementation, but some are constrained, via a chain back to the top-level intentions of the designer.
</p>

<hr  />

<p>
If a detail is important to achieve an overall quality of the system, it is probably architectural.
</p>
</div>
</div>
