programming/book/just_enough_software_architecture.org
** Why is software architecture important?

_Architecture is the art of imposing just enough constraints so that the system has the quality attributes you want._ A design that ensures scalability may require some components to be stateless in order to achieve that scalability.

- _Constraints reduce needless creativity of developers._
- _Constraints are a means to transfer wisdom or understanding from one developer to another._
- Constraints can factor out complexity, yielding a system with evident underlying principles. (Once complexity has joined the party, it can be difficult to send it home.)

-----

An architecture is more than the big visible parts, and the invisible parts are often more important. For example, your locking policy, memory management strategy, or technique for integrating third-party components.

-----

Functional requirements that evolve over time are a challenge to any system, but evolving quality attributes can force drastic changes. A system that was designed to support a hundred users may be impossible to scale up to a hundred thousand without an architectural change. You often see successive generations or waves of an application as it outgrows its old architecture, somewhat like a crab outgrowing its shell.

-----

A single good idea consistently applied is better than several brilliant ideas scattered across a system.

** Presumptive architectures

A presumptive architecture is a family of architectures that is dominant in a particular domain. Rather than justifying their choice to use it, developers in that domain may have to justify a choice that differs from the presumptive architecture.

A reference architecture is a family of architectures that describes an architectural solution to a problem and it is usually written down as a specification. A publisher of a reference architecture may hope that it becomes a presumptive architecture, but that may never happen. That is, a reference architecture is often an aspirational standard, while a presumptive architecture is a de facto standard.

** How should software architecture be used?

Architecture-focused design is compatible with your goals, though that choice does not provide assurances, only opportunities.

Architecture hoisting requires your architecture to play an active role, one that you can rely on to achieve your goals. When following an architecture hoisting approach, developers design the architecture with the intent of guaranteeing a goal or property of the system.

The idea is that _once a goal or property has been hoisted into the architecture, developers should not need to write any additional code to achieve it._ In the architecture-indifferent or architecture-focused designs there was no code that you could point to and say, "This is the code that ensures our 50ms response time."

Architecture hoisting can be seen as a kind of tyranny over developers, burdening them with additional constraints and bureaucracy. Or it can be seen as liberation for developers, _freeing them to focus on functionality instead of quality attributes._

Volkswagen GTI designers had followed architecture-focused design and included seatbelts, but I had to remember to buckle them each time. Its architecture was compatible with safety, but did not guarantee it. Today, it is impossible to buy a car that has not hoisted safety into its architecture, because every car is required to have airbags that deploy automatically. 

** Architecture-focused design

Architecture-focused design seeks architectural solutions, rather than local fixes, to problems.

-----

Be on the lookout for requirements that will influence your architecture choices, but these requirements are rarely stated clearly. They may be hidden in a cryptic statement from a stakeholder or be common to other systems in your domain.

* Chapter 3: Risk-Driven Model

#+begin_quote
The concept of failure is central to the design process, and it is by thinking in terms of obviating failure that successful designs are achieved. Failure considerations and proactive failure analysis are essential for achieving success.
#+end_quote

To address failure risks, the earliest software developers invented design techniques, such as domain modeling, security analyses, and encapsulation.

** What is the risk-driven model?

Use risk to decide how much architecture work to do. Build successful systems by taking a path that spends your time most effectively. Apply architecture and design techniques but only when they are motivated by risks. _The effort spent on designing software architecture should be commensurate with the risk of failure._

** Are you risk-driven now?

Imagine a company that builds a 3-tier system. The first tier has the user interface and is exposed to the internet. Its biggest risks might be usability and security. The second and third tiers implement business rules and persistence; they are behind a firewall. The biggest risks might be throughput and scalability

** Risks

risk = perceived probability of failure x perceived impact

-----

#+caption: Examples of project management and engineering risks
| *Project management risks*     | *Software engineering risks*                                          |
|--------------------------------+-----------------------------------------------------------------------|
| Lead developer hit by bus.     | The server may not scale to 1000 users.                               |
|--------------------------------+-----------------------------------------------------------------------|
| Customer needs not understood. | Parsing of the response messages may be buggy.                        |
|--------------------------------+-----------------------------------------------------------------------|
| Senior VP hates our manager.   | The system is working now but if we touch anything it may fall apart. |

-----

It is better to describe risks such that you can later test to see if they have been mitigated. Describe each risk of failure as a testable failure scenario, such as "During peak loads, customers experience user interface latencies greater than five seconds."

