programming/book/just_enough_software_architecture.html
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Why is software architecture important?</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<span class="underline">Architecture is the art of imposing just enough constraints so that the system has the quality attributes you want.</span> A design that ensures scalability may require some components to be stateless in order to achieve that scalability.
</p>

<ul class="org-ul">
<li><span class="underline">Constraints reduce needless creativity of developers.</span>
</li>
<li><span class="underline">Constraints are a means to transfer wisdom or understanding from one developer to another.</span>
</li>
<li>Constraints can factor out complexity, yielding a system with evident underlying principles. (Once complexity has joined the party, it can be difficult to send it home.)
</li>
</ul>

<hr  />

<p>
An architecture is more than the big visible parts, and the invisible parts are often more important. For example, your locking policy, memory management strategy, or technique for integrating third-party components.
</p>

<hr  />

<p>
Functional requirements that evolve over time are a challenge to any system, but evolving quality attributes can force drastic changes. A system that was designed to support a hundred users may be impossible to scale up to a hundred thousand without an architectural change. You often see successive generations or waves of an application as it outgrows its old architecture, somewhat like a crab outgrowing its shell.
</p>

<hr  />

<p>
A single good idea consistently applied is better than several brilliant ideas scattered across a system.
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Presumptive architectures</h3>
<div class="outline-text-3" id="text-3-3">
<p>
A presumptive architecture is a family of architectures that is dominant in a particular domain. Rather than justifying their choice to use it, developers in that domain may have to justify a choice that differs from the presumptive architecture.
</p>

<p>
A reference architecture is a family of architectures that describes an architectural solution to a problem and it is usually written down as a specification. A publisher of a reference architecture may hope that it becomes a presumptive architecture, but that may never happen. That is, a reference architecture is often an aspirational standard, while a presumptive architecture is a de facto standard.
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> How should software architecture be used?</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Architecture-focused design is compatible with your goals, though that choice does not provide assurances, only opportunities.
</p>

<p>
Architecture hoisting requires your architecture to play an active role, one that you can rely on to achieve your goals. When following an architecture hoisting approach, developers design the architecture with the intent of guaranteeing a goal or property of the system.
</p>

<p>
The idea is that <span class="underline">once a goal or property has been hoisted into the architecture, developers should not need to write any additional code to achieve it.</span> In the architecture-indifferent or architecture-focused designs there was no code that you could point to and say, "This is the code that ensures our 50ms response time."
</p>

<p>
Architecture hoisting can be seen as a kind of tyranny over developers, burdening them with additional constraints and bureaucracy. Or it can be seen as liberation for developers, <span class="underline">freeing them to focus on functionality instead of quality attributes.</span>
</p>

<p>
Volkswagen GTI designers had followed architecture-focused design and included seatbelts, but I had to remember to buckle them each time. Its architecture was compatible with safety, but did not guarantee it. Today, it is impossible to buy a car that has not hoisted safety into its architecture, because every car is required to have airbags that deploy automatically. 
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Architecture-focused design</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Architecture-focused design seeks architectural solutions, rather than local fixes, to problems.
</p>

<hr  />

<p>
Be on the lookout for requirements that will influence your architecture choices, but these requirements are rarely stated clearly. They may be hidden in a cryptic statement from a stakeholder or be common to other systems in your domain.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Chapter 3: Risk-Driven Model</h2>
<div class="outline-text-2" id="text-4">
<div class="org-quote-container">
<blockquote>
<p>
The concept of failure is central to the design process, and it is by thinking in terms of obviating failure that successful designs are achieved. Failure considerations and proactive failure analysis are essential for achieving success.
</p>
</blockquote>
</div>

<p>
To address failure risks, the earliest software developers invented design techniques, such as domain modeling, security analyses, and encapsulation.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> What is the risk-driven model?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Use risk to decide how much architecture work to do. Build successful systems by taking a path that spends your time most effectively. Apply architecture and design techniques but only when they are motivated by risks. <span class="underline">The effort spent on designing software architecture should be commensurate with the risk of failure.</span>
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Are you risk-driven now?</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Imagine a company that builds a 3-tier system. The first tier has the user interface and is exposed to the internet. Its biggest risks might be usability and security. The second and third tiers implement business rules and persistence; they are behind a firewall. The biggest risks might be throughput and scalability
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Risks</h3>
<div class="outline-text-3" id="text-4-3">
<p>
risk = perceived probability of failure x perceived impact
</p>

<hr  />

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Examples of project management and engineering risks</caption>

<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left"><b>Project management risks</b></th>
<th scope="col" class="left"><b>Software engineering risks</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Lead developer hit by bus.</td>
<td class="left">The server may not scale to 1000 users.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Customer needs not understood.</td>
<td class="left">Parsing of the response messages may be buggy.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Senior VP hates our manager.</td>
<td class="left">The system is working now but if we touch anything it may fall apart.</td>
</tr>
</tbody>
</table>

<hr  />

<p>
It is better to describe risks such that you can later test to see if they have been mitigated. Describe each risk of failure as a testable failure scenario, such as "During peak loads, customers experience user interface latencies greater than five seconds."
</p>
</div>
</div>
