programming/book/just_enough_software_architecture.html
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Guidance on choosing techniques</h3>
<div class="outline-text-3" id="text-4-4">
<p>
In his book How to Solve It, George Polya identifies two distinct kinds of math problems: problems to find and problems to prove. <span class="underline">Finding things tends to be easier than proving things because for proofs you need to demonstrate something is true in all possible cases.</span>
</p>

<p>
It is easy to imagine writing a test case for "Can the database hold names up to 100 characters?" Conversely, it is hard to imagine a small set of test cases providing persuasive evidence when you have a problem to prove. Your tests could succeed, but there could be a case you have not yet seen. An example of a problem to prove is deadlock: Any number of tests can run successfully without revealing a problem in a locking protocol.
</p>

<hr  />

<p>
In an analogic model, each model element has an analogue in the domain of interest. A radar screen is an analogic model of some terrain, where blips on the screen correspond to airplanes, the blip and the airplane are analogues. Analogic models support analysis only indirectly, and usually domain knowledge or human reasoning are required. A radar screen can't answer the question "Are these planes on a collision course?" To do so you need to use your special purpose brainpower.
</p>

<p>
<span class="underline">An analytic model, by contrast, directly supports computational analysis.</span> Mathematical equations are examples of analytic models, as are state machines. You could imagine an analytic model of the airplanes where each is represented by a vector. Mathematics provides an analytic capability to relate the vectors, so you could quantitatively answer questions about collision courses.
</p>

<p>
When you know what risks you want to mitigate, you can appropriately choose an analytic or analogic model. For example, if you are concerned that your engineers may not understand the relationships between domain entities, you may build an analogic model in UML and confirm it with domain experts. Conversely, if you need to calculate response time distributions, then you will want an analytic model.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-01-28 Sun 19:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
